garyPenhook/PyAvrOCD/svd/avr64da28s.svd
        <register>
          <name>MUXPOS</name>
          <description>Positive mux input</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXPOS</name>
              <description>Analog Channel Selection Bits</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIN0</name>
                  <description>ADC input pin 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN1</name>
                  <description>ADC input pin 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN2</name>
                  <description>ADC input pin 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN3</name>
                  <description>ADC input pin 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN4</name>
                  <description>ADC input pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN5</name>
                  <description>ADC input pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN6</name>
                  <description>ADC input pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN7</name>
                  <description>ADC input pin 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN16</name>
                  <description>ADC input pin 16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN17</name>
                  <description>ADC input pin 17</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSENSE</name>
                  <description>Temperature sensor</description>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC0</name>
                  <description>DAC0</description>
                  <value>72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACREF0</name>
                  <description>DACREF0</description>
                  <value>73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACREF1</name>
                  <description>DACREF1</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACREF2</name>
                  <description>DACREF2</description>
                  <value>75</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RES</name>
          <description>ADC Accumulator Result</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SAMPCTRL</name>
          <description>Sample Control</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPLEN</name>
              <description>Sample lenght</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP</name>
          <description>Temporary Data</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEMP</name>
              <description>Temporary</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WINHT</name>
          <description>Window comparator high threshold</description>
          <addressOffset>0x14</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>WINLT</name>
          <description>Window comparator low threshold</description>
          <addressOffset>0x12</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
